app/views/quizzes/index.html.erb

		<table>
		<% @question.options.each do |option| %>
---
SELECT "options".* FROM "options" WHERE ("options".question_id = 1)