app/controllers/answers_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."id" = 1 LIMIT 1
INSERT INTO "answers" ("answer", "user_id", "quiz_id", "created_at", "updated_at", "option_id", "question_id") VALUES (NULL, NULL, NULL, '2011-08-28 21:57:36.017265', '2011-08-28 21:57:36.017265', 3, 1)
UPDATE "answers" SET "user_id" = 1, "quiz_id" = 1, "updated_at" = '2011-08-28 21:54:08.352924' WHERE "answers"."id" = 22
---
  def create
    @question = Question.find(params[:question_id])
    @answer = @question.answers.create(params[:answer])
    @answer.user_id = current_user
    @answer.quiz_id = @question.id
    @answer.save

SELECT "answers".* FROM "answers" WHERE "answers"."id" = 1 LIMIT 1
SELECT "questions".* FROM "questions" WHERE "questions"."id" = 1 LIMIT 1
---
  def show
    @answer = Answer.find(params[:id])
    @question = Question.find(params[:question_id])