app/controllers/answers_controller.rb

SELECT "options".* FROM "options" WHERE "options"."id" = 1 LIMIT 1
---
  def show
    @answer = Answer.find(params[:id])
    @question = Question.find(@answer.question_id)
    @option = Option.find(@answer.answer)