app/controllers/quizzes_controller.rb

SELECT "questions".* FROM "questions" ORDER BY "questions"."id" DESC LIMIT 1
---
  def index
    @question = Question.last