app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt", "admin") VALUES ('Brian', 'quaranto@gmail.com', '2011-08-28 18:18:22.787573', '2011-08-28 18:18:22.787573', '10ced5b3b219ecbd9092754e47af8fc8b66ecf746c6951b4815e864f1da5e2a4', 'bf992ac4c773b9b57ca203592b12fc995d761f81a9ea98bc87372d721f4f7716', 'f')